#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_compute_disk.game_data_disk: Refreshing state... [id=projects/minecraft-abekoh/zones/asia-northeast1-b/disks/game-data-disk]
google_compute_network.vpc_network: Refreshing state... [id=projects/minecraft-abekoh/global/networks/minecraft-network]
google_compute_address.static_ip: Refreshing state... [id=projects/minecraft-abekoh/regions/asia-northeast1/addresses/minecraft-server-static-ip]
google_storage_bucket.backup: Refreshing state... [id=minecraft-abekoh-backup]
google_compute_firewall.allow_dynmap: Refreshing state... [id=projects/minecraft-abekoh/global/firewalls/allow-dynmap]
google_compute_firewall.allow_icmp: Refreshing state... [id=projects/minecraft-abekoh/global/firewalls/allow-icmp]
google_compute_firewall.allow_minecraft: Refreshing state... [id=projects/minecraft-abekoh/global/firewalls/allow-minecraft]
google_compute_firewall.allow_ssh: Refreshing state... [id=projects/minecraft-abekoh/global/firewalls/allow-ssh]
google_compute_instance.bot_instance: Refreshing state... [id=projects/minecraft-abekoh/zones/us-central1-b/instances/minecraft-abekoh-discord-bot]
google_compute_instance.vm_instance: Refreshing state... [id=projects/minecraft-abekoh/zones/asia-northeast1-b/instances/minecraft-abekoh]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_compute_instance.vm_instance has changed
  ~ resource "google_compute_instance" "vm_instance" {
      ~ cpu_platform         = "Unknown CPU Platform" -> "Intel Broadwell"
      ~ current_status       = "TERMINATED" -> "RUNNING"
        id                   = "projects/minecraft-abekoh/zones/asia-northeast1-b/instances/minecraft-abekoh"
        name                 = "minecraft-abekoh"
        tags                 = [
            "minecraft-server",
        ]
        # (15 unchanged attributes hidden)






        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.bot_instance must be replaced
-/+ resource "google_compute_instance" "bot_instance" {
      ~ cpu_platform         = "Intel Haswell" -> (known after apply)
      ~ current_status       = "RUNNING" -> (known after apply)
      - enable_display       = false -> null
      ~ guest_accelerator    = [] -> (known after apply)
      ~ id                   = "projects/minecraft-abekoh/zones/us-central1-b/instances/minecraft-abekoh-discord-bot" -> (known after apply)
      ~ instance_id          = "5212243769563297718" -> (known after apply)
      ~ label_fingerprint    = "42WmSpB8rSM=" -> (known after apply)
      - labels               = {} -> null
      ~ metadata_fingerprint = "2Zpe4c7HITY=" -> (known after apply)
      + min_cpu_platform     = (known after apply)
        name                 = "minecraft-abekoh-discord-bot"
      ~ project              = "minecraft-abekoh" -> (known after apply)
      - resource_policies    = [] -> null
      ~ self_link            = "https://www.googleapis.com/compute/v1/projects/minecraft-abekoh/zones/us-central1-b/instances/minecraft-abekoh-discord-bot" -> (known after apply)
      - tags                 = [] -> null
      ~ tags_fingerprint     = "42WmSpB8rSM=" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/minecraft-abekoh/zones/us-central1-b/disks/minecraft-abekoh-discord-bot" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2004-focal-v20210908" -> "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2004-focal-v20211202" # forces replacement
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/minecraft-abekoh/global/networks/minecraft-network" -> "minecraft-network"
          ~ network_ip         = "10.128.0.4" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/minecraft-abekoh/regions/us-central1/subnetworks/minecraft-network" -> (known after apply)
          ~ subnetwork_project = "minecraft-abekoh" -> (known after apply)

          ~ access_config {
              ~ nat_ip       = "35.225.142.119" -> (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ min_node_cpus       = 0 -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }


      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
        # (1 unchanged block hidden)
    }

  # google_compute_instance.vm_instance must be replaced
-/+ resource "google_compute_instance" "vm_instance" {
      ~ cpu_platform         = "Intel Broadwell" -> (known after apply)
      ~ current_status       = "RUNNING" -> (known after apply)
      - enable_display       = false -> null
      ~ guest_accelerator    = [] -> (known after apply)
      ~ id                   = "projects/minecraft-abekoh/zones/asia-northeast1-b/instances/minecraft-abekoh" -> (known after apply)
      ~ instance_id          = "386076855424268192" -> (known after apply)
      ~ label_fingerprint    = "42WmSpB8rSM=" -> (known after apply)
      - labels               = {} -> null
      ~ metadata_fingerprint = "V4o-fc6C7UI=" -> (known after apply)
      + min_cpu_platform     = (known after apply)
        name                 = "minecraft-abekoh"
      ~ project              = "minecraft-abekoh" -> (known after apply)
      - resource_policies    = [] -> null
      ~ self_link            = "https://www.googleapis.com/compute/v1/projects/minecraft-abekoh/zones/asia-northeast1-b/instances/minecraft-abekoh" -> (known after apply)
        tags                 = [
            "minecraft-server",
        ]
      ~ tags_fingerprint     = "eKJo3f3n-AU=" -> (known after apply)
      ~ zone                 = "asia-northeast1-b" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ attached_disk {
          ~ device_name                = "persistent-disk-1" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/minecraft-abekoh/zones/asia-northeast1-b/disks/game-data-disk" -> "game-data-disk"
            # (1 unchanged attribute hidden)
        }

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/minecraft-abekoh/zones/asia-northeast1-b/disks/minecraft-abekoh" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2004-focal-v20210908" -> "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2004-focal-v20211202" # forces replacement
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/minecraft-abekoh/global/networks/minecraft-network" -> "minecraft-network"
          ~ network_ip         = "10.146.0.13" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/minecraft-abekoh/regions/asia-northeast1/subnetworks/minecraft-network" -> (known after apply)
          ~ subnetwork_project = "minecraft-abekoh" -> (known after apply)

          ~ access_config {
              ~ network_tier = "PREMIUM" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          - min_node_cpus       = 0 -> null
          ~ on_host_maintenance = "TERMINATE" -> (known after apply)
            # (2 unchanged attributes hidden)
        }


      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
        # (1 unchanged block hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @abekoh, Action: `pull_request`, Working Directory: ``, Workflow: `validate & plan Terraform`*